# pandas serisi oluşturmak

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
pd.Series([10,88,305,45,8,66])

0     10
1     88
2    305
3     45
4      8
5     66
dtype: int64

seride değerleri indeksleriyle beraber tutuyor, veri yapısının içinde tutuluyor.

In [4]:
seri =  pd.Series([10,88,305,45,8,66])

In [5]:
type(seri)

pandas.core.series.Series

In [6]:
seri.axes

[RangeIndex(start=0, stop=6, step=1)]

In [7]:
seri.dtype

dtype('int64')

In [8]:
seri.size

6

In [9]:
seri.ndim

1

In [10]:
seri.values

array([ 10,  88, 305,  45,   8,  66], dtype=int64)

In [11]:
seri.head()

0     10
1     88
2    305
3     45
4      8
dtype: int64

In [12]:
seri.head(3)

0     10
1     88
2    305
dtype: int64

In [13]:
seri.tail()

1     88
2    305
3     45
4      8
5     66
dtype: int64

index isimlendirmesi

In [14]:
pd.Series([99,33,55,66,77])

0    99
1    33
2    55
3    66
4    77
dtype: int64

In [15]:
pd.Series([99,33,55,66,77], index = [1,3,5,7,9])  #indexleri belirleme

1    99
3    33
5    55
7    66
9    77
dtype: int64

In [16]:
pd.Series([77, 66 ,444 ,231 ,951], index = ["a", "b", "c", "d", "e"]) # indexleri istediğimiz biçimde isimlendirebiliyoruz

a     77
b     66
c    444
d    231
e    951
dtype: int64

In [17]:
seri = pd.Series([77, 66 ,444 ,231 ,951], index = ["a", "b", "c", "d", "e"])

In [18]:
seri["a"] #seri elemanına erişim

77

In [19]:
seri["a" : "c"] #slicing

a     77
b     66
c    444
dtype: int64

dict üzerinden liste oluşturmak

In [20]:
d =  pd.Series({"reg": 10, "log": 11, "cart": 12})

In [21]:
d

reg     10
log     11
cart    12
dtype: int64

## pandas eleman işlemleri

#pandas #pandas-serisi #pandas-data-frame #serilerde-eleman-işlemleri

In [22]:
import numpy as np

In [23]:
a = np.array([1, 2, 33, 444, 75])  #pandas serisini yapısal olarak ele alalım

In [24]:
pseri = pd.Series(a)
pseri

0      1
1      2
2     33
3    444
4     75
dtype: int32

In [25]:
pseri[0]

1

In [26]:
pseri[0:3]

0     1
1     2
2    33
dtype: int32

In [27]:
seri1 = pd.Series([121, 200, 150, 99], index = ["reg", "loj","cart","rf"])

In [28]:
seri1

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [29]:
seri1.index #indexe erişim

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [30]:
seri1.values #serinin değerlerine erişim

array([121, 200, 150,  99], dtype=int64)

In [31]:
seri1.keys

<bound method Series.keys of reg     121
loj     200
cart    150
rf       99
dtype: int64>

eleman sorgulama

In [32]:
"reg" in seri1 #eleman seri de mi sorgulama

True

In [33]:
"a" in seri1

False

In [34]:
seri1["reg"]

121

In [35]:
seri1[["rf", "reg"]]  #fancy index yaklaşımı

rf      99
reg    121
dtype: int64

In [36]:
seri1

reg     121
loj     200
cart    150
rf       99
dtype: int64

In [37]:
seri1["reg"] = 130 #eleman atama

In [38]:
seri1

reg     130
loj     200
cart    150
rf       99
dtype: int64

In [39]:
seri1["reg": "loj"]

reg    130
loj    200
dtype: int64

## Pandas DataFrame

 #pandas #dataframe-birleştirme #dataframe-koşullu-eleman-işlemleri #loc #iloc #eleman-işlemleri #pandas-dataframe-eleman-işlemleri #pandas-DataFrame

pandas dataframe oluşturma

In [40]:
import pandas as pd

In [41]:
liste = [1, 2, 39, 67, 90]

In [42]:
liste

[1, 2, 39, 67, 90]

In [43]:
pd.DataFrame(liste, columns=["var_names"])

   var_names
0          1
1          2
2         39
3         67
4         90

In [44]:
import numpy as np

In [45]:
m = np.arange(1,10).reshape((3,3))

In [46]:
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [47]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

>df isimlendirme

In [48]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [49]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [50]:
df.columns = ("deg1", "deg2", "deg3")

In [51]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [52]:
type(df)

pandas.core.frame.DataFrame

In [53]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [54]:
df.shape

(3, 3)

In [55]:
df.ndim

2

In [56]:
df.size

9

In [57]:
df.values #numpy arrayi olarak geri cevap veriyor, sadece dataframeden değerleri çekip numpy arraye forma döndürüyor

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [58]:
type(df.values)

numpy.ndarray

In [59]:
df.tail()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [60]:
df.tail(1)

   deg1  deg2  deg3
2     7     8     9

>numpy array üzerinden pandas dataframe oluşturmak

In [61]:
a = np.array([1,2,3,4,5])

In [62]:
pd.DataFrame(a, columns = ["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

> ELeman İşlemleri

In [63]:
import numpy as pd

In [64]:
import pandas as pd

In [65]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

3 tane numpy array oluşturduk bunlardan df oluşturulalım

In [66]:
dict = {"var1": s1, "var2": s2, "var3": s3} #sözlük oluşturualım

In [67]:
dict

{'var1': array([6, 9, 0, 2, 6]),
 'var2': array([4, 3, 4, 8, 2]),
 'var3': array([2, 8, 1, 2, 5])}

In [68]:
df  = pd.DataFrame(dict) #dict üzerinden dataframe oluşturmak

In [69]:
df

   var1  var2  var3
0     6     4     2
1     9     3     8
2     0     4     1
3     2     8     2
4     6     2     5

In [70]:
df[0:1]

   var1  var2  var3
0     6     4     2

index değerlerini değiştirebiliyoruz

In [71]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [72]:
df.index = ["a", "b", "c", "d", "e"]
df

   var1  var2  var3
a     6     4     2
b     9     3     8
c     0     4     1
d     2     8     2
e     6     2     5

In [73]:
df["c":"e"] #index üzerinden slicing

   var1  var2  var3
c     0     4     1
d     2     8     2
e     6     2     5

silme işlemi

In [74]:
df.drop("a", axis = 0)

   var1  var2  var3
b     9     3     8
c     0     4     1
d     2     8     2
e     6     2     5

In [75]:
df

   var1  var2  var3
a     6     4     2
b     9     3     8
c     0     4     1
d     2     8     2
e     6     2     5

inplace argümanı çalıştırdığımıxda df de kalıcı değişişiklik yaparız.

In [76]:
df.drop("a", axis = 0, inplace = True)

In [77]:
df

   var1  var2  var3
b     9     3     8
c     0     4     1
d     2     8     2
e     6     2     5

fancy ile silme işlemi

In [78]:
list1 = ["c", "e"]
list1

['c', 'e']

In [79]:
df.drop(list1, axis = 0 ) #inplace argümanını da kullanarsak kalıcı değişiklik yaparız

   var1  var2  var3
b     9     3     8
d     2     8     2

değişkenler için

In [80]:
"var1" in df

True

In [81]:
list2 = [ "var1", "var4", "var2"]

In [82]:
for i in list2: # listenin içindeki her elemanı df 'in içinde mi diye sorgulayalım
    print(i in df)

True
False
True

In [83]:
df

   var1  var2  var3
b     9     3     8
c     0     4     1
d     2     8     2
e     6     2     5

yeni bir değişken oluşturma

In [84]:
df["var1"]

b    9
c    0
d    2
e    6
Name: var1, dtype: int32

In [85]:
df["var4"] = df["var1"] / df["var2"]  #var4 değişkenini oluşturma

In [86]:
df

   var1  var2  var3  var4
b     9     3     8  3.00
c     0     4     1  0.00
d     2     8     2  0.25
e     6     2     5  3.00

deişken silme

In [87]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     9     3     8
c     0     4     1
d     2     8     2
e     6     2     5

In [88]:
df

   var1  var2  var3  var4
b     9     3     8  3.00
c     0     4     1  0.00
d     2     8     2  0.25
e     6     2     5  3.00

In [89]:
df.drop("var4", axis = 1, inplace = True) #var4 değişkenini kalıcı olarak silme

In [90]:
df

   var1  var2  var3
b     9     3     8
c     0     4     1
d     2     8     2
e     6     2     5

In [91]:
list3 = ["var1", "var2"]

In [92]:
df.drop(list3, axis = 1)

   var3
b     8
c     1
d     2
e     5

### gözlem ve değişken seçimi  : loc and iloc

In [93]:
import numpy as pd
import pandas as pd
f = np.random.randint(1,30, size = (10,3))  # 1den 30a random integer sayılarla np array oluşturalım
f

array([[16, 27, 14],
       [17, 29, 28],
       [ 1, 28, 19],
       [11,  7,  9],
       [12,  6, 10],
       [24,  5, 22],
       [10, 19,  2],
       [ 7, 19, 11],
       [10,  8,  3],
       [ 3,  6,  2]])

In [94]:
df = pd.DataFrame(f, columns = ["var1", "var2", "var3"]) #oluşturduğumuz f np arrayini, labeled columnlar oluştururak pandasa çevirelim
df

   var1  var2  var3
0    16    27    14
1    17    29    28
2     1    28    19
3    11     7     9
4    12     6    10
5    24     5    22
6    10    19     2
7     7    19    11
8    10     8     3
9     3     6     2

In [95]:
np.random.randint?

Docstring:
randint(low, high=None, size=None, dtype=int)

Return random integers from `low` (inclusive) to `high` (exclusive).

Return random integers from the "discrete uniform" distribution of
the specified dtype in the "half-open" interval [`low`, `high`). If
`high` is None (the default), then results are from [0, `low`).

.. note::
    New code should use the `~numpy.random.Generator.randint`
    method of a `~numpy.random.Generator` instance instead;
    please see the :ref:`random-quick-start`.

Parameters
----------
low : int or array-like of ints
    Lowest (signed) integers to be drawn from the distribution (unless
    ``high=None``, in which case this parameter is one above the
    *highest* such integer).
high : int or array-like of ints, optional
    If provided, one above the largest (signed) integer to be drawn
    from the distribution (see above for behavior if ``high=None``).
    If array-like, must contain integer values
size : int or tuple of ints, optional
    Output shape.  If the given shape is, e.g., ``(m, n, k)``, then
    ``m * n * k`` samples are drawn.  Default is None, in which case a
    single value is returned.
dtype : dtype, optional
    Desired dtype of the result. Byteorder must be native.
    The default value is int.

    .. versionadded:: 1.11.0

Returns
-------
out : int or ndarray of ints
    `size`-shaped array of random integers from the appropriate
    distribution, or a single such random int if `size` not provided.

See Also
--------
random_integers : similar to `randint`, only for the closed
    interval [`low`, `high`], and 1 is the lowest value if `high` is
    omitted.
random.Generator.integers: which should be used for new code.

Examples
--------
>>> np.random.randint(2, size=10)
array([1, 0, 0, 0, 1, 1, 0, 0, 1, 0]) # random
>>> np.random.randint(1, size=10)
array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

Generate a 2 x 4 array of ints between 0 and 4, inclusive:

>>> np.random.randint(5, size=(2, 4))
array([[4, 0, 2, 1], # random
       [3, 2, 2, 0]])

Generate a 1 x 3 array with 3 different upper bounds

>>> np.random.randint(1, [3, 5, 10])
array([2, 2, 9]) # random

Generate a 1 by 3 array with 3 different lower bounds

>>> np.random.randint([1, 5, 7], 10)
array([9, 8, 7]) # random

Generate a 2 by 4 array using broadcasting with dtype of uint8

>>> np.random.randint([1, 3, 5, 7], [[10], [20]], dtype=np.uint8)
array([[ 8,  6,  9,  7], # random
       [ 1, 16,  9, 12]], dtype=uint8)
Type:      builtin_function_or_method

> tarayıcınıza google çeviri eklentisini ekleyin

> loc: tanımlandığı şekliyle seçim yapmak için kullanılır, label based olunca slice işlemlerinde belirttiğiniz son değer inclusive olur

In [96]:
df

   var1  var2  var3
0    16    27    14
1    17    29    28
2     1    28    19
3    11     7     9
4    12     6    10
5    24     5    22
6    10    19     2
7     7    19    11
8    10     8     3
9     3     6     2

In [97]:
df.loc[0:3]

   var1  var2  var3
0    16    27    14
1    17    29    28
2     1    28    19
3    11     7     9

>  iloc: integer based python usulü seçim yapmak için kullanılır. Alışık olduğumuz indexleme mantığı ile seçim yapar, lokasyon bazlı

In [98]:
df

   var1  var2  var3
0    16    27    14
1    17    29    28
2     1    28    19
3    11     7     9
4    12     6    10
5    24     5    22
6    10    19     2
7     7    19    11
8    10     8     3
9     3     6     2

In [99]:
df.iloc[0:3]

   var1  var2  var3
0    16    27    14
1    17    29    28
2     1    28    19

In [100]:
df.iloc[0,0]

16

In [101]:
df.iloc[:3, :2]

   var1  var2
0    16    27
1    17    29
2     1    28

In [102]:
df

   var1  var2  var3
0    16    27    14
1    17    29    28
2     1    28    19
3    11     7     9
4    12     6    10
5    24     5    22
6    10    19     2
7     7    19    11
8    10     8     3
9     3     6     2

In [103]:
df.loc[0:3, "var3"]

0    14
1    28
2    19
3     9
Name: var3, dtype: int32

eğer mutlak bir şekilde , değişken ismi ve gözlem birimi veya index isimleriyle seçim yapmak istersek loc u tercih edeceğiz, inxedxli seçim yapmak istersek iloc kullanacağız, iloc klasik index positioning mantığı

In [104]:
df.iloc[0:3]

   var1  var2  var3
0    16    27    14
1    17    29    28
2     1    28    19

iloc ile tek değişken seçmek istersek:

In [105]:
df.iloc[0:3]["var3"]

0    14
1    28
2    19
Name: var3, dtype: int32

## Koşullu Eleman İşlemleri

In [106]:
import numpy as np
import pandas as pd

In [107]:
s = np.random.randint(1,30, size = (10,3))

In [108]:
df = pd.DataFrame(s, columns = [ "var1", "var2", "var3"])

In [109]:
df # 3 değişken 10 gözlem birimi var

   var1  var2  var3
0     8    24     4
1    26     1    14
2    11     7    23
3    11    15    26
4     9    15    14
5    14    15     3
6    14    23    25
7     4    11    21
8     9    26    24
9    27    10    13

In [110]:
df["var1"]

0     8
1    26
2    11
3    11
4     9
5    14
6    14
7     4
8     9
9    27
Name: var1, dtype: int32

In [111]:
df["var1"][0:2]

0     8
1    26
Name: var1, dtype: int32

In [112]:
df[0:2]

   var1  var2  var3
0     8    24     4
1    26     1    14

In [113]:
df[0:2]["var1"]

0     8
1    26
Name: var1, dtype: int32

In [114]:
df[0:2][["var1", "var2"]]

   var1  var2
0     8    24
1    26     1

In [115]:
df

   var1  var2  var3
0     8    24     4
1    26     1    14
2    11     7    23
3    11    15    26
4     9    15    14
5    14    15     3
6    14    23    25
7     4    11    21
8     9    26    24
9    27    10    13

In [116]:
df[df.var1 > 15]

   var1  var2  var3
1    26     1    14
9    27    10    13

In [117]:
df[df.var1 > 15]["var1"]

1    26
9    27
Name: var1, dtype: int32

In [118]:
df[df.var1 > 15]["var2"]

1     1
9    10
Name: var2, dtype: int32

In [119]:
df[df.var1 > 15]["var3"]

1    14
9    13
Name: var3, dtype: int32

In [120]:
df

   var1  var2  var3
0     8    24     4
1    26     1    14
2    11     7    23
3    11    15    26
4     9    15    14
5    14    15     3
6    14    23    25
7     4    11    21
8     9    26    24
9    27    10    13

In [121]:
df[df.var1 > 15]

   var1  var2  var3
1    26     1    14
9    27    10    13

In [122]:
df[(df.var1 > 15) & (df.var3 < 5)]

Empty DataFrame
Columns: [var1, var2, var3]
Index: []

In [123]:
df[(df.var1 > 15) | (df.var3 < 5)]

   var1  var2  var3
0     8    24     4
1    26     1    14
5    14    15     3
9    27    10    13

In [124]:
df.loc[(df.var1 > 15), ["var1", "var2"]]

   var1  var2
1    26     1
9    27    10

In [125]:
df[(df.var1 > 15)][["var1", "var2"]]

   var1  var2
1    26     1
9    27    10

## Birleştirme - Join İşlemleri

In [126]:
import numpy as np
import pandas as pd
e = np.random.randint(1,30, size = (5,3))

In [127]:
df1 = pd.DataFrame(e, columns = ["var1", "var2", "var3"])

In [128]:
df1

   var1  var2  var3
0    15    17     6
1    26    18    25
2    24    25    23
3    23     3     1
4     4     4    18

> concatenate

In [129]:
df2 = df1 + 99

In [130]:
df2

   var1  var2  var3
0   114   116   105
1   125   117   124
2   123   124   122
3   122   102   100
4   103   103   117

In [131]:
pd.concat([df1, df2])

   var1  var2  var3
0    15    17     6
1    26    18    25
2    24    25    23
3    23     3     1
4     4     4    18
0   114   116   105
1   125   117   124
2   123   124   122
3   122   102   100
4   103   103   117

In [132]:
pd.concat?

Signature:
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[HashableT, NDFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\users\90530\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [133]:
pd.concat([df1, df2]) #indexte sıkıntı olduğu gözlemleniyor

   var1  var2  var3
0    15    17     6
1    26    18    25
2    24    25    23
3    23     3     1
4     4     4    18
0   114   116   105
1   125   117   124
2   123   124   122
3   122   102   100
4   103   103   117

In [134]:
pd.concat([df1, df2], ignore_index = True) #pd.concat? yardımıyla problemi çözecek parametreyi buluyoruz: ignore_index

   var1  var2  var3
0    15    17     6
1    26    18    25
2    24    25    23
3    23     3     1
4     4     4    18
5   114   116   105
6   125   117   124
7   123   124   122
8   122   102   100
9   103   103   117

In [135]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [136]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [137]:
df2.columns = ["var1", "var2", "deg3"]

In [138]:
df2.columns

Index(['var1', 'var2', 'deg3'], dtype='object')

In [139]:
df2

   var1  var2  deg3
0   114   116   105
1   125   117   124
2   123   124   122
3   122   102   100
4   103   103   117

In [140]:
df1

   var1  var2  var3
0    15    17     6
1    26    18    25
2    24    25    23
3    23     3     1
4     4     4    18

In [141]:
pd.concat([df1, df2])

   var1  var2  var3   deg3
0    15    17   6.0    NaN
1    26    18  25.0    NaN
2    24    25  23.0    NaN
3    23     3   1.0    NaN
4     4     4  18.0    NaN
0   114   116   NaN  105.0
1   125   117   NaN  124.0
2   123   124   NaN  122.0
3   122   102   NaN  100.0
4   103   103   NaN  117.0

inner join

In [142]:
pd.concat([df1, df2], join = "inner", ignore_index =True)

   var1  var2
0    15    17
1    26    18
2    24    25
3    23     3
4     4     4
5   114   116
6   125   117
7   123   124
8   122   102
9   103   103

In [143]:
pd.concat([df1, df2], join_axes = [df1.columns])

TypeError: concat() got an unexpected keyword argument 'join_axes'

In [ ]:
pd.concat?

## ileri birleştirme işlemleri

In [ ]:
import pandas as pd

birebir birleştirme

In [ ]:
df1 = pd.DataFrame({ "çalışanlar": ["Ali", "Veli", "Ayşe", "Fatma"], "grup": [ "Muhasebe", "Muhendislik", "Muhendislik", "IK"]})
df1

In [ ]:
df2 = pd.DataFrame({ "çalışanlar": [ "Ayşe", "Ali","Veli", "Fatma" ], "ilk_giris": [ 2010, 2009, 2014 ,2019]})

In [ ]:
df2

merge fonksiyonu

In [ ]:
pd.merge(df1,df2) #merge fonk birleştirmelerin hangi değişkene göre yapılacağını kendisi anlıyor

değişkeni özelli,kle belirtmek için

In [ ]:
pd.merge(df1,df2, on ="çalışanlar")

many to one

In [ ]:
df3 = pd.merge(df1, df2)

In [ ]:
df3

In [ ]:
df4 =  pd.DataFrame({ "grup": ["Muhasebe", "Muhendislik", "IK"], "mudur": ["Caner", "Mustafa", "Berkcan"]})
df4

In [ ]:
pd.merge(df3,df4)

many to many

In [ ]:
df5 = pd.DataFrame({ "grup": ["Muhasebe", "Muhasebe", "Muhendislik", "Muhendislik", "IK", "IK"],
                    "yetenekler": [ "matematik", "excel", "kodlama", "linux", "excel", "yonetim"]})

In [ ]:
df5

In [ ]:
df1

In [ ]:
pd.merge(df1,df5)

## Toplulaştırma ve Gruplama ( Aggregation and Grouping)

### Basit toplulaştırma fonksiyonları(simple Aggregation functions):

count()

first()

last()

mean()

median()

min()

max()

std()

var()

sum()

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
import seaborn as sns

In [ ]:
df = sns.load_dataset("planets")

In [ ]:
df

In [ ]:
sns.load_dataset?

In [ ]:
df.head()

In [ ]:
df.shape

In [ ]:
df.tail()

In [ ]:
df["mass"].mean()

In [ ]:
df["mass"].count()

In [ ]:
df["mass"].min()

In [ ]:
df.describe()

In [ ]:
df["mass"].max()

In [ ]:
df["mass"].sum()

In [ ]:
df.ndim

In [ ]:
df["mass"].std()

In [ ]:
df["mass"].var()

In [ ]:
df.describe().T

In [ ]:
df.dropna().describe().T

## Gruplama İşlemleri - Grouping

In [ ]:
df6 = pd.DataFrame({ "gruplar": [ "A", "B", "C", "A", "B", "C"], "veri": [10,11,52,23,43,55]}, columns = [ "gruplar", "veri"])

In [ ]:
df6

In [ ]:
df6.groupby("gruplar") # dataframe a git gruplar değişkenini yakala bu gruplar değişkeninin içinde yer alan kategori sınıflarını tut, groupby fonk tek başına çalışamaz aggregate fonk lazım,

In [ ]:
df6.groupby("gruplar").mean()

In [ ]:
df6.groupby("gruplar").sum()

In [ ]:
df = sns.load_dataset("planets")
df

In [ ]:
df.groupby("method")

In [ ]:
df.groupby("method")["orbital_period"]

In [ ]:
df.groupby("method")["orbital_period"].mean()

In [ ]:
df.groupby("method")["mass"].mean().dropna()

In [ ]:
df.groupby("method")["orbital_period"].describe()

## Aggregate

İleri toplulaştırma İşlemleri - aggregate, filter, transform and apply

In [ ]:
import pandas as pd

In [ ]:
df7 = pd.DataFrame({ "gruplar": [ "A", "B", "C", "A", "B", "C"],
                    "var1": [10,23,33,22,11,99],
                    "var2": [100,253,333,262,111,969]},
                   columns = [ "gruplar", "var1", "var2"])
df7

### Aggregate

In [ ]:
df7.groupby("gruplar")

In [ ]:
df7.groupby("gruplar").mean()

In [ ]:
import numpy as np

In [ ]:
df7.groupby("gruplar").aggregate(["min", np.median, "max"])

var1 için değişik istatistik, var2 için başka bir istatistik uygulamaya çalışalım

In [ ]:
df7.groupby("gruplar").aggregate({"var1": "min", "var2": "max"})

### Filter Fonksiyonu

In [ ]:
df7

In [ ]:
def filter_func(x):
    return x["var1"].std() > 9

In [ ]:
df7.groupby("gruplar").std()

In [ ]:
df7.groupby("gruplar").filter(filter_func)

### Transform

In [ ]:
df7

dönüştürme işlmei yapmak ve bunu kendimiz tanımlama istiyoruz

In [ ]:
df7["var1"] * 9

In [ ]:
df_a = df7.iloc[:, 1:3]
df_a

In [ ]:
df_a.transform(lambda x: (x  - x.mean()) / x.std())

### Apply fonksiyonu

In [144]:
df8 = pd.DataFrame({"var1": [10,23,33,22,11,99],
                    "var2": [100,253,333,262,111,969]},
                   columns = [ "var1", "var2"])
df8

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [145]:
df8.apply(np.sum)

var1     198
var2    2028
dtype: int64

In [146]:
df8.apply(np.mean)

var1     33.0
var2    338.0
dtype: float64

In [147]:
df9 = pd.DataFrame({ "gruplar": [ "A", "B", "C", "A", "B", "C"],
                    "var1": [10,23,33,22,11,99],
                    "var2": [100,253,333,262,111,969]},
                   columns = [ "gruplar", "var1", "var2"])
df9

  gruplar  var1  var2
0       A    10   100
1       B    23   253
2       C    33   333
3       A    22   262
4       B    11   111
5       C    99   969

In [148]:
df9.groupby("gruplar").apply(np.sum)

        gruplar  var1  var2
gruplar
A            AA    32   362
B            BB    34   364
C            CC   132  1302

### pivot tavlolar

In [149]:
import pandas as pd

In [150]:
import numpy as np

In [151]:
import seaborn as sns

In [152]:
titanic = sns.load_dataset('titanic')

In [153]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [155]:
titanic.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [158]:
titanic.size

13365

In [159]:
titanic.shape

(891, 15)

In [160]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [168]:
titanic.groupby(["sex", "class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

pivot ile table

In [169]:
titanic.pivot_table("survived", index = "sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [171]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [172]:
age = pd.cut(titanic["age"], [0,18,90])  #sürekli değişkeni kategorik bir değişkene değiştirme

In [174]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [176]:
titanic.pivot_table("survived", [ "sex", age], "class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [177]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

### Dış Kaynaklı Veri Okumak

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.read_csv("ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

ayraç kullanıldığından düzgün okutmak için:

In [5]:
pd.read_csv("ornekcsv.csv", sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

text okuma

In [6]:
pd.read_csv("duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [7]:
pd.read_csv?

Signature:
pd.read_csv(
    filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]',
    *,
    sep: 'str | None | lib.NoDefault' = <no_default>,
    delimiter: 'str | None | lib.NoDefault' = None,
    header: "int | Sequence[int] | None | Literal['infer']" = 'infer',
    names: 'Sequence[Hashable] | None | lib.NoDefault' = <no_default>,
    index_col: 'IndexLabel | Literal[False] | None' = None,
    usecols=None,
    dtype: 'DtypeArg | None' = None,
    engine: 'CSVEngine | None' = None,
    converters=None,
    true_values=None,
    false_values=None,
    skipinitialspace: 'bool' = False,
    skiprows=None,
    skipfooter: 'int' = 0,
    nrows: 'int | None' = None,
    na_values=None,
    keep_default_na: 'bool' = True,
    na_filter: 'bool' = True,
    verbose: 'bool' = False,
    skip_blank_lines: 'bool' = True,
    parse_dates: 'bool | Sequence[Hashable] | None' = None,
    infer_datetime_format: 'bool | lib.NoDefault' = <no_default>,
    keep_date_col: 'bool' = False,
    date_parser=<no_default>,
    date_format: 'str | None' = None,
    dayfirst: 'bool' = False,
    cache_dates: 'bool' = True,
    iterator: 'bool' = False,
    chunksize: 'int | None' = None,
    compression: 'CompressionOptions' = 'infer',
    thousands: 'str | None' = None,
    decimal: 'str' = '.',
    lineterminator: 'str | None' = None,
    quotechar: 'str' = '"',
    quoting: 'int' = 0,
    doublequote: 'bool' = True,
    escapechar: 'str | None' = None,
    comment: 'str | None' = None,
    encoding: 'str | None' = None,
    encoding_errors: 'str | None' = 'strict',
    dialect: 'str | csv.Dialect | None' = None,
    on_bad_lines: 'str' = 'error',
    delim_whitespace: 'bool' = False,
    low_memory=True,
    memory_map: 'bool' = False,
    float_precision: "Literal['high', 'legacy'] | None" = None,
    storage_options: 'StorageOptions' = None,
    dtype_backend: 'DtypeBackend | lib.NoDefault' = <no_default>,
) -> 'DataFrame | TextFileReader'
Docstring:
Read a comma-separated values (csv) file into DataFrame.

Also supports optionally iterating or breaking of the file
into chunks.

Additional help can be found in the online docs for
`IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

Parameters
----------
filepath_or_buffer : str, path object or file-like object
    Any valid string path is acceptable. The string could be a URL. Valid
    URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
    expected. A local file could be: file://localhost/path/to/table.csv.

    If you want to pass in a path object, pandas accepts any ``os.PathLike``.

    By file-like object, we refer to objects with a ``read()`` method, such as
    a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
sep : str, default ','
    Delimiter to use. If sep is None, the C engine cannot automatically detect
    the separator, but the Python parsing engine can, meaning the latter will
    be used and automatically detect the separator by Python's builtin sniffer
    tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
    different from ``'\s+'`` will be interpreted as regular expressions and
    will also force the use of the Python parsing engine. Note that regex
    delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
delimiter : str, default ``None``
    Alias for sep.
header : int, list of int, None, default 'infer'
    Row number(s) to use as the column names, and the start of the
    data.  Default behavior is to infer the column names: if no names
    are passed the behavior is identical to ``header=0`` and column
    names are inferred from the first line of the file, if column
    names are passed explicitly then the behavior is identical to
    ``header=None``. Explicitly pass ``header=0`` to be able to
    replace existing names. The header can be a list of integers that
    specify row locations for a multi-index on the columns
    e.g. [0,1,3]. Intervening rows that are not specified will be
    skipped (e.g. 2 in this example is skipped). Note that this
    parameter ignores commented lines and empty lines if
    ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
    data rather than the first line of the file.
names : array-like, optional
    List of column names to use. If the file contains a header row,
    then you should explicitly pass ``header=0`` to override the column names.
    Duplicates in this list are not allowed.
index_col : int, str, sequence of int / str, or False, optional, default ``None``
  Column(s) to use as the row labels of the ``DataFrame``, either given as
  string name or column index. If a sequence of int / str is given, a
  MultiIndex is used.

  Note: ``index_col=False`` can be used to force pandas to *not* use the first
  column as the index, e.g. when you have a malformed file with delimiters at
  the end of each line.
usecols : list-like or callable, optional
    Return a subset of the columns. If list-like, all elements must either
    be positional (i.e. integer indices into the document columns) or strings
    that correspond to column names provided either by the user in `names` or
    inferred from the document header row(s). If ``names`` are given, the document
    header row(s) are not taken into account. For example, a valid list-like
    `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
    Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
    To instantiate a DataFrame from ``data`` with element order preserved use
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
    in ``['foo', 'bar']`` order or
    ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
    for ``['bar', 'foo']`` order.

    If callable, the callable function will be evaluated against the column
    names, returning names where the callable function evaluates to True. An
    example of a valid callable argument would be ``lambda x: x.upper() in
    ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
    parsing time and lower memory usage.
dtype : Type name or dict of column -> type, optional
    Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
    'c': 'Int64'}
    Use `str` or `object` together with suitable `na_values` settings
    to preserve and not interpret dtype.
    If converters are specified, they will be applied INSTEAD
    of dtype conversion.

    .. versionadded:: 1.5.0

        Support for defaultdict was added. Specify a defaultdict as input where
        the default determines the dtype of the columns which are not explicitly
        listed.
engine : {'c', 'python', 'pyarrow'}, optional
    Parser engine to use. The C and pyarrow engines are faster, while the python engine
    is currently more feature-complete. Multithreading is currently only supported by
    the pyarrow engine.

    .. versionadded:: 1.4.0

        The "pyarrow" engine was added as an *experimental* engine, and some features
        are unsupported, or may not work correctly, with this engine.
converters : dict, optional
    Dict of functions for converting values in certain columns. Keys can either
    be integers or column labels.
true_values : list, optional
    Values to consider as True in addition to case-insensitive variants of "True".
false_values : list, optional
    Values to consider as False in addition to case-insensitive variants of "False".
skipinitialspace : bool, default False
    Skip spaces after delimiter.
skiprows : list-like, int or callable, optional
    Line numbers to skip (0-indexed) or number of lines to skip (int)
    at the start of the file.

    If callable, the callable function will be evaluated against the row
    indices, returning True if the row should be skipped and False otherwise.
    An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
skipfooter : int, default 0
    Number of lines at bottom of file to skip (Unsupported with engine='c').
nrows : int, optional
    Number of rows of file to read. Useful for reading pieces of large files.
na_values : scalar, str, list-like, or dict, optional
    Additional strings to recognize as NA/NaN. If dict passed, specific
    per-column NA values.  By default the following values are interpreted as
    NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
    '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'None',
    'n/a', 'nan', 'null'.
keep_default_na : bool, default True
    Whether or not to include the default NaN values when parsing the data.
    Depending on whether `na_values` is passed in, the behavior is as follows:

    * If `keep_default_na` is True, and `na_values` are specified, `na_values`
      is appended to the default NaN values used for parsing.
    * If `keep_default_na` is True, and `na_values` are not specified, only
      the default NaN values are used for parsing.
    * If `keep_default_na` is False, and `na_values` are specified, only
      the NaN values specified `na_values` are used for parsing.
    * If `keep_default_na` is False, and `na_values` are not specified, no
      strings will be parsed as NaN.

    Note that if `na_filter` is passed in as False, the `keep_default_na` and
    `na_values` parameters will be ignored.
na_filter : bool, default True
    Detect missing value markers (empty strings and the value of na_values). In
    data without any NAs, passing na_filter=False can improve the performance
    of reading a large file.
verbose : bool, default False
    Indicate number of NA values placed in non-numeric columns.
skip_blank_lines : bool, default True
    If True, skip over blank lines rather than interpreting as NaN values.
parse_dates : bool or list of int or names or list of lists or dict, default False
    The behavior is as follows:

    * boolean. If True -> try parsing the index.
    * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
      each as a separate date column.
    * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
      a single date column.
    * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
      result 'foo'

    If a column or index cannot be represented as an array of datetimes,
    say because of an unparsable value or a mixture of timezones, the column
    or index will be returned unaltered as an object data type. For
    non-standard datetime parsing, use ``pd.to_datetime`` after
    ``pd.read_csv``.

    Note: A fast-path exists for iso8601-formatted dates.
infer_datetime_format : bool, default False
    If True and `parse_dates` is enabled, pandas will attempt to infer the
    format of the datetime strings in the columns, and if it can be inferred,
    switch to a faster method of parsing them. In some cases this can increase
    the parsing speed by 5-10x.

    .. deprecated:: 2.0.0
        A strict version of this argument is now the default, passing it has no effect.

keep_date_col : bool, default False
    If True and `parse_dates` specifies combining multiple columns then
    keep the original columns.
date_parser : function, optional
    Function to use for converting a sequence of string columns to an array of
    datetime instances. The default uses ``dateutil.parser.parser`` to do the
    conversion. Pandas will try to call `date_parser` in three different ways,
    advancing to the next if an exception occurs: 1) Pass one or more arrays
    (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
    string values from the columns defined by `parse_dates` into a single array
    and pass that; and 3) call `date_parser` once for each row using one or
    more strings (corresponding to the columns defined by `parse_dates`) as
    arguments.

    .. deprecated:: 2.0.0
       Use ``date_format`` instead, or read in as ``object`` and then apply
       :func:`to_datetime` as-needed.
date_format : str or dict of column -> format, default ``None``
   If used in conjunction with ``parse_dates``, will parse dates according to this
   format. For anything more complex,
   please read in as ``object`` and then apply :func:`to_datetime` as-needed.

   .. versionadded:: 2.0.0
dayfirst : bool, default False
    DD/MM format dates, international and European format.
cache_dates : bool, default True
    If True, use a cache of unique, converted dates to apply the datetime
    conversion. May produce significant speed-up when parsing duplicate
    date strings, especially ones with timezone offsets.

iterator : bool, default False
    Return TextFileReader object for iteration or getting chunks with
    ``get_chunk()``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
chunksize : int, optional
    Return TextFileReader object for iteration.
    See the `IO Tools docs
    <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
    for more information on ``iterator`` and ``chunksize``.

    .. versionchanged:: 1.2

       ``TextFileReader`` is a context manager.
compression : str or dict, default 'infer'
    For on-the-fly decompression of on-disk data. If 'infer' and 'filepath_or_buffer' is
    path-like, then detect compression from the following extensions: '.gz',
    '.bz2', '.zip', '.xz', '.zst', '.tar', '.tar.gz', '.tar.xz' or '.tar.bz2'
    (otherwise no compression).
    If using 'zip' or 'tar', the ZIP file must contain only one data file to be read in.
    Set to ``None`` for no decompression.
    Can also be a dict with key ``'method'`` set
    to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``, ``'tar'``} and other
    key-value pairs are forwarded to
    ``zipfile.ZipFile``, ``gzip.GzipFile``,
    ``bz2.BZ2File``, ``zstandard.ZstdDecompressor`` or
    ``tarfile.TarFile``, respectively.
    As an example, the following could be passed for Zstandard decompression using a
    custom compression dictionary:
    ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

    .. versionadded:: 1.5.0
        Added support for `.tar` files.

    .. versionchanged:: 1.4.0 Zstandard support.

thousands : str, optional
    Thousands separator.
decimal : str, default '.'
    Character to recognize as decimal point (e.g. use ',' for European data).
lineterminator : str (length 1), optional
    Character to break file into lines. Only valid with C parser.
quotechar : str (length 1), optional
    The character used to denote the start and end of a quoted item. Quoted
    items can include the delimiter and it will be ignored.
quoting : int or csv.QUOTE_* instance, default 0
    Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
    QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
doublequote : bool, default ``True``
   When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
   whether or not to interpret two consecutive quotechar elements INSIDE a
   field as a single ``quotechar`` element.
escapechar : str (length 1), optional
    One-character string used to escape other characters.
comment : str, optional
    Indicates remainder of line should not be parsed. If found at the beginning
    of a line, the line will be ignored altogether. This parameter must be a
    single character. Like empty lines (as long as ``skip_blank_lines=True``),
    fully commented lines are ignored by the parameter `header` but not by
    `skiprows`. For example, if ``comment='#'``, parsing
    ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
    treated as the header.
encoding : str, optional, default "utf-8"
    Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
    standard encodings
    <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

    .. versionchanged:: 1.2

       When ``encoding`` is ``None``, ``errors="replace"`` is passed to
       ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
       This behavior was previously only the case for ``engine="python"``.

    .. versionchanged:: 1.3.0

       ``encoding_errors`` is a new argument. ``encoding`` has no longer an
       influence on how encoding errors are handled.

encoding_errors : str, optional, default "strict"
    How encoding errors are treated. `List of possible values
    <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

    .. versionadded:: 1.3.0

dialect : str or csv.Dialect, optional
    If provided, this parameter will override values (default or not) for the
    following parameters: `delimiter`, `doublequote`, `escapechar`,
    `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
    override values, a ParserWarning will be issued. See csv.Dialect
    documentation for more details.
on_bad_lines : {'error', 'warn', 'skip'} or callable, default 'error'
    Specifies what to do upon encountering a bad line (a line with too many fields).
    Allowed values are :

        - 'error', raise an Exception when a bad line is encountered.
        - 'warn', raise a warning when a bad line is encountered and skip that line.
        - 'skip', skip bad lines without raising or warning when they are encountered.

    .. versionadded:: 1.3.0

    .. versionadded:: 1.4.0

        - callable, function with signature
          ``(bad_line: list[str]) -> list[str] | None`` that will process a single
          bad line. ``bad_line`` is a list of strings split by the ``sep``.
          If the function returns ``None``, the bad line will be ignored.
          If the function returns a new list of strings with more elements than
          expected, a ``ParserWarning`` will be emitted while dropping extra elements.
          Only supported when ``engine="python"``

delim_whitespace : bool, default False
    Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
    used as the sep. Equivalent to setting ``sep='\s+'``. If this option
    is set to True, nothing should be passed in for the ``delimiter``
    parameter.
low_memory : bool, default True
    Internally process the file in chunks, resulting in lower memory use
    while parsing, but possibly mixed type inference.  To ensure no mixed
    types either set False, or specify the type with the `dtype` parameter.
    Note that the entire file is read into a single DataFrame regardless,
    use the `chunksize` or `iterator` parameter to return the data in chunks.
    (Only valid with C parser).
memory_map : bool, default False
    If a filepath is provided for `filepath_or_buffer`, map the file object
    directly onto memory and access the data directly from there. Using this
    option can improve performance because there is no longer any I/O overhead.
float_precision : str, optional
    Specifies which converter the C engine should use for floating-point
    values. The options are ``None`` or 'high' for the ordinary converter,
    'legacy' for the original lower precision pandas converter, and
    'round_trip' for the round-trip converter.

    .. versionchanged:: 1.2

storage_options : dict, optional
    Extra options that make sense for a particular storage connection, e.g.
    host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
    are forwarded to ``urllib.request.Request`` as header options. For other
    URLs (e.g. starting with "s3://", and "gcs://") the key-value pairs are
    forwarded to ``fsspec.open``. Please see ``fsspec`` and ``urllib`` for more
    details, and for more examples on storage options refer `here
    <https://pandas.pydata.org/docs/user_guide/io.html?
    highlight=storage_options#reading-writing-remote-files>`_.

    .. versionadded:: 1.2

dtype_backend : {"numpy_nullable", "pyarrow"}, defaults to NumPy backed DataFrames
    Which dtype_backend to use, e.g. whether a DataFrame should have NumPy

In [9]:
pd.read_excel("ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [10]:
df11 = pd.read_excel("ornekx.xlsx")

In [11]:
df11

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [12]:
df11.head()

    a    b    c
0  78   12  1.0
1  78   12  2.0
2  78  324  3.0
3   7    2  4.0
4  88   23  5.0

In [13]:
type(df11)

pandas.core.frame.DataFrame

In [14]:
df11.columns = ( "A", "B", "C" )

In [15]:
df11

      A    B     C
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0